stressTesting/getMeta.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 60
      arrivalRate: 25
      name: "25 request per second"
  # -duration: 60
  # arrivalRate: 10
  # name: 10 request per second
  # -duration: 60
  # arrivalRate: 100
  # name: 100 request per second
  variables:
    productIds:
      - ['43434']
      - ['34']
      - ['2653']
      - ['434534']
      - ['11134']
      - ['22363']
      - ['434']
      - ['10']
      - ['1000000']
scenarios:
  - name: "get reviews"
    flow:
      - loop:
        - get:
            url: "/reviews/{{ $loopElement }}/meta"
        over: productIds